import os


class VideoEdit():
    def __init__(self):
        # For many child
        self.many_child_wishes = {
            'obey_parents': 'K_Wishes_01.mp4',
            'good_to_eat': 'K_Wishes_02.mp4',
            'study_well': 'K_Wishes_03.mp4',
            'find_new_friends': 'K_Wishes_04.mp4',
            'read_more_books': 'K_Wishes_05.mp4',
        }

        # For one child
        self.name_m: dict = {'Александр': 'Александр.mp4', 'Алексей': 'Алексей.mp4', 'Альберт': 'Альберт.mp4', 'Анатолий': 'Анатолий.mp4', 'Андрей': 'Андрей.mp4', 'Антон': 'Антон.mp4', 'Аркадий': 'Аркадий.mp4', 'Арсений': 'Арсений.mp4', 'Артём': 'Артём.mp4', 'Артемий': 'Артемий.mp4', 'Артур': 'Артур.mp4', 'Афанасий': 'Афанасий.mp4', 'Богдан': 'Богдан.mp4', 'Борис': 'Борис.mp4', 'Вадим': 'Вадим.mp4', 'Валентин': 'Валентин.mp4', 'Валерий': 'Валерий.mp4', 'Василий': 'Василий.mp4', 'Вениамин': 'Вениамин.mp4', 'Викентий': 'Викентий.mp4', 'Виктор': 'Виктор.mp4', 'Виссарион': 'Виссарион.mp4', 'Виталий': 'Виталий.mp4', 'Владимир': 'Владимир.mp4', 'Владислав': 'Владислав.mp4', 'Всеволод': 'Всеволод.mp4', 'Вячеслав': 'Вячеслав.mp4', 'Гавриил': 'Гавриил.mp4', 'Геннадий': 'Геннадий.mp4', 'Георгий': 'Георгий.mp4', 'Герасим': 'Герасим.mp4', 'Герман': 'Герман.mp4', 'Глеб': 'Глеб.mp4', 'Гордей': 'Гордей.mp4', 'Григорий': 'Григорий.mp4', 'Даниил': 'Даниил.mp4', 'Данил': 'Данил.mp4', 'Демид': 'Демид.mp4', 'Демьян': 'Демьян.mp4', 'Денис': 'Денис.mp4', 'Дмитрий': 'Дмитрий.mp4', 'Добрыня': 'Добрыня.mp4', 'Дорофей': 'Дорофей.mp4', 'Евгений': 'Евгений.mp4', 'Евсей': 'Евсей.mp4', 'Егор': 'Егор.mp4', 'Емельян': 'Емельян.mp4', 'Еремей': 'Еремей.mp4', 'Ерофей': 'Ерофей.mp4', 'Ефим': 'Ефим.mp4', 'Ждан': 'Ждан.mp4', 'Захар': 'Захар.mp4', 'Иван': 'Иван.mp4', 'Игнатий': 'Игнатий.mp4', 'Игорь': 'Игорь.mp4', 'Илья': 'Илья.mp4', 'Иннокентий': 'Иннокентий.mp4', 'Ираклий': 'Ираклий.mp4', 'Ким': 'Ким.mp4', 'Кир': 'Кир.mp4', 'Кирилл': 'Кирилл.mp4', 'Клим': 'Клим.mp4',
                       'Константин': 'Константин.mp4', 'Кузьма': 'Кузьма.mp4', 'Лаврентий': 'Лаврентий.mp4', 'Лев': 'Лев.mp4', 'Леонид': 'Леонид.mp4', 'Лука': 'Лука.mp4', 'Лукьян': 'Лукьян.mp4', 'Макар': 'Макар.mp4', 'Максим': 'Максим.mp4', 'Макс': 'Максим.mp4', 'Марк': 'Марк.mp4', 'Мартин': 'Мартин.mp4', 'Матвей': 'Матвей.mp4', 'Мирослав': 'Мирослав.mp4', 'Митрофан': 'Митрофан.mp4', 'Михаил': 'Михаил.mp4', 'Мстислав': 'Мстислав.mp4', 'Назар': 'Назар.mp4', 'Нестор': 'Нестор.mp4', 'Никанор': 'Никанор.mp4', 'Никита': 'Никита.mp4', 'Никодим': 'Никодим.mp4', 'Николай': 'Николай.mp4', 'Никон': 'Никон.mp4', 'Олег': 'Олег.mp4', 'Пётр': 'Пётр.mp4', 'Павел': 'Павел.mp4', 'Пантелеймон': 'Пантелеймон.mp4', 'Пахом': 'Пахом.mp4', 'Платон': 'Платон.mp4', 'Потап': 'Потап.mp4', 'Прохор': 'Прохор.mp4', 'Родион': 'Родион.mp4', 'Роман': 'Роман.mp4', 'Ростислав': 'Ростислав.mp4', 'Руслан': 'Руслан.mp4', 'Савва': 'Савва.mp4', 'Савелий': 'Савелий.mp4', 'Самуил': 'Самуил.mp4', 'Святослав': 'Святослав.mp4', 'Севастьян': 'Севастьян.mp4', 'Семён': 'Семён.mp4', 'Серафим': 'Серафим.mp4', 'Сергей': 'Сергей.mp4', 'Спиридон': 'Спиридон.mp4', 'Станислав': 'Станислав.mp4', 'Степан': 'Степан.mp4', 'Тарас': 'Тарас.mp4', 'Тимофей': 'Тимофей.mp4', 'Тимур': 'Тимур.mp4', 'Тихон': 'Тихон.mp4', 'Трофим': 'Трофим.mp4', 'Фёдор': 'Фёдор.mp4', 'Фаддей': 'Фаддей.mp4', 'Феликс': 'Феликс.mp4', 'Филипп': 'Филипп.mp4', 'Фома': 'Фома.mp4', 'Харитон': 'Харитон.mp4', 'Эдуард': 'Эдуард.mp4', 'Юлиан': 'Юлиан.mp4', 'Юрий': 'Юрий.mp4', 'Яков': 'Яков.mp4', 'Ян': 'Ян.mp4', 'Ярослав': 'Ярослав.mp4',
                       'no_name': 'No_Name.mp4',
                       'Саша': 'Александр.mp4',
                       'Лёша': 'Алексей.mp4',
                       'Толя': 'Анатолий.mp4',
                       'Толик': 'Анатолий.mp4',
                       'Аркаша': 'Аркадий.mp4',
                       'Тёма': 'Артём.mp4',
                       'Боря': 'Борис.mp4',
                       'Вадя': 'Вадим.mp4',
                       'Вадик': 'Вадим.mp4',
                       'Валя': 'Валентин.mp4',
                       'Валера': 'Валерий.mp4',
                       'Вася': 'Василий.mp4',
                       'Веня': 'Вениамин.mp4',
                       'Витя': 'Виктор.mp4',
                       'Виталик': 'Виталий.mp4',
                       'Вова': 'Владимир.mp4',
                       'Володя': 'Владимир.mp4',
                       'Влад': 'Владислав.mp4',
                       'Владик': 'Владислав.mp4',
                       'Слава': 'Вячеслав.mp4',
                       'Гена': 'Геннадий.mp4',
                       'Жорик': 'Георгий.mp4',
                       'Гриша': 'Григорий.mp4',
                       'Дима': 'Дмитрий.mp4',
                       'Женя': 'Евгений.mp4',
                       'Ваня': 'Иван.mp4',
                       'Костя': 'Константин.mp4',
                       'Леня': 'Леонид.mp4',
                       'Миша': 'Михаил.mp4',
                       'Коля': 'Николай.mp4',
                       'Паша': 'Павел.mp4',
                       'Петр': 'Пётр.mp4',
                       'Петя': 'Пётр.mp4',
                       'Родя': 'Родион.mp4',
                       'Рома': 'Роман.mp4',
                       'Сёма': 'Семён.mp4',
                       'Сема': 'Семён.mp4',
                       'Серёжа': 'Сергей.mp4',
                       'Сережа': 'Сергей.mp4',
                       'Стас': 'Станислав.mp4',
                       'Сиасик': 'Станислав.mp4',
                       'Федя': 'Фёдор.mp4',
                       'Филя': 'Филипп.mp4',
                       'Эдик': 'Эдуард.mp4',
                       'Юра': 'Юрий.mp4',
                       'Ярик': 'Ярослав.mp4'
                    }

        self.name_w: dict = {'Агафья': 'Агафья.mp4', 'Аглая': 'Аглая.mp4', 'Агния': 'Агния.mp4', 'Азалия': 'Азалия.mp4', 'Акулина': 'Акулина.mp4', 'Алевтина': 'Алевтина.mp4', 'Александра': 'Александра.mp4', 'Алина': 'Алина.mp4', 'Алла': 'Алла.mp4', 'Анастасия': 'Анастасия.mp4', 'Ангелина': 'Ангелина.mp4', 'Анжела': 'Анжела.mp4', 'Анжелика': 'Анжелика.mp4', 'Анна': 'Анна.mp4', 'Антонина': 'Антонина.mp4', 'Анфиса': 'Анфиса.mp4', 'Валентина': 'Валентина.mp4', 'Валерия': 'Валерия.mp4', 'Варвара': 'Варвара.mp4', 'Василиса': 'Василиса.mp4', 'Вера': 'Вера.mp4', 'Вероника': 'Вероника.mp4', 'Виктория': 'Виктория.mp4', 'Виолетта': 'Виолетта.mp4', 'Галина': 'Галина.mp4', 'Глафира': 'Глафира.mp4', 'Дана': 'Дана.mp4', 'Дарья': 'Дарья.mp4', 'Евгения': 'Евгения.mp4', 'Евдокия': 'Евдокия.mp4', 'Евлалия': 'Евлалия.mp4', 'Евпраксия': 'Евпраксия.mp4', 'Евфросиния': 'Евфросиния.mp4', 'Екатерина': 'Екатерина.mp4', 'Елена': 'Елена.mp4', 'Елизавета': 'Елизавета.mp4', 'Жанна': 'Жанна.mp4', 'Зинаида': 'Зинаида.mp4', 'Злата': 'Злата.mp4', 'Зоя': 'Зоя.mp4', 'Инга': 'Инга.mp4', 'Инесса': 'Инесса.mp4', 'Инна': 'Инна.mp4', 'Иоанна': 'Иоанна.mp4', 'Ираида': 'Ираида.mp4', 'Ирина': 'Ирина.mp4',
                        'Ия': 'Ия.mp4', 'Карина': 'Карина.mp4', 'Каролина': 'Каролина.mp4', 'Кира': 'Кира.mp4', 'Клавдия': 'Клавдия.mp4', 'Ксения': 'Ксения.mp4', 'Лада': 'Лада.mp4', 'Лариса': 'Лариса.mp4', 'Лидия': 'Лидия.mp4', 'Лилия': 'Лилия.mp4', 'Любовь': 'Любовь.mp4', 'Людмила': 'Людмила.mp4', 'Маргарита': 'Маргарита.mp4', 'Марина': 'Марина.mp4', 'Мария': 'Мария.mp4', 'Марфа': 'Марфа.mp4', 'Матрёна': 'Матрёна.mp4', 'Мирослава': 'Мирослава.mp4', 'Надежда': 'Надежда.mp4', 'Наталья': 'Наталья.mp4', 'Нина': 'Нина.mp4', 'Нонна': 'Нонна.mp4', 'Оксана': 'Оксана.mp4', 'Октябрина': 'Октябрина.mp4', 'Олимпиада': 'Олимпиада.mp4', 'Ольга': 'Ольга.mp4', 'Павлина': 'Павлина.mp4', 'Пелагея': 'Пелагея.mp4', 'Полина': 'Полина.mp4', 'Прасковья': 'Прасковья.mp4', 'Рада': 'Рада.mp4', 'Раиса': 'Раиса.mp4', 'Регина': 'Регина.mp4', 'Римма': 'Римма.mp4', 'Руслана': 'Руслана.mp4', 'Светлана': 'Светлана.mp4', 'Серафима': 'Серафима.mp4', 'Снежана': 'Снежана.mp4', 'София': 'София.mp4', 'Таисия': 'Таисия.mp4', 'Тамара': 'Тамара.mp4', 'Татьяна': 'Татьяна.mp4', 'Ульяна': 'Ульяна.mp4', 'Фёкла': 'Фёкла.mp4', 'Фаина': 'Фаина.mp4', 'Юлия': 'Юлия.mp4', 'Яна': 'Яна.mp4', 'Ярослава': 'Ярослава.mp4',
                        'no_name': 'No_Name.mp4', 'Агля': 'Аглая.mp4',
                        'Залия': 'Азалия.mp4',
                        'Аля': 'Алевтина.mp4',
                        'Саша': 'Александра.mp4',
                        'Настя': 'Анастасия.mp4',
                        'Геля': 'Ангелина.mp4',
                        'Анюта': 'Анна.mp4',
                        'Аня': 'Анна.mp4',
                        'Валя': 'Валентина.mp4',
                        'Лера': 'Валерия.mp4',
                        'Варя': 'Варвара.mp4',
                        'Вася': 'Василиса.mp4',
                        'Вика': 'Виктория.mp4',
                        'Виола': 'Виолетта.mp4',
                        'Галя': 'Галина.mp4',
                        'Даша': 'Дарья.mp4',
                        'Женя': 'Евгения.mp4',
                        'Катя': 'Екатерина.mp4',
                        'Катюша': 'Екатерина.mp4',
                        'Лена': 'Елена.mp4',
                        'Лиза': 'Елизавета.mp4',
                        'Зина': 'Зинаида.mp4',
                        'Ира': 'Ирина.mp4',
                        'Клава': 'Клавдия.mp4',
                        'Ксюша': 'Ксения.mp4',
                        'Лара': 'Лариса.mp4',
                        'Лида': 'Лидия.mp4',
                        'Лиля': 'Лилия.mp4',
                        'Люба': 'Любовь.mp4',
                        'Люда': 'Людмила.mp4',
                        'Рита': 'Маргарита.mp4',
                        'Маша': 'Мария.mp4',
                        'Мара': 'Марфа.mp4',
                        'Надя': 'Надежда.mp4',
                        'Наташа': 'Наталья.mp4',
                        'Оля': 'Ольга.mp4',
                        'Поля': 'Полина.mp4',
                        'Рая': 'Раиса.mp4',
                        'Света': 'Светлана.mp4',
                        'Соня': 'София.mp4',
                        'Софья': 'София.mp4',
                        'Тася': 'Таисия.mp4',
                        'Тома': 'Тамара.mp4',
                        'Таня': 'Татьяна.mp4',
                        'Уля': 'Ульяна.mp4',
                        'Фая': 'Фаина.mp4',
                        'Юля': 'Юлия.mp4',
                    }

        self.ages = {
            1: 'Age_01.mp4',
            2: 'Age_02.mp4',
            3: 'Age_03.mp4',
            4: 'Age_04.mp4',
            5: 'Age_05.mp4',
            6: 'Age_06.mp4',
            7: 'Age_07.mp4',
            8: 'Age_08.mp4',
            9: 'Age_09.mp4',
            10: 'Age_10.mp4',
            11: 'Age_11.mp4',
            12: 'Age_12.mp4',
            13: 'Age_13.mp4',
            14: 'Age_14.mp4',
        }

        self.hobbies = {
            'read': 'Hobbies_01.mp4',
            'paint': 'Hobbies_02.mp4',
            'walk': 'Hobbies_03.mp4',
            'do_sport': 'Hobbies_04.mp4',
            'watch_cartoons': 'Hobbies_05.mp4',
            'eat_sweets': 'Hobbies_06.mp4',
            'sing': 'Hobbies_07.mp4',
            'play_music': 'Hobbies_08.mp4',
            'play_games': 'Hobbies_09.mp4',
            'dance': 'Hobbies_10.mp4',
        }

        self.wishes = {
            'obey_parents': 'Wishes_01.mp4',
            'good_to_eat': 'Wishes_03.mp4',
            'study_well': 'Wishes_02.mp4',
            'find_new_friends': 'Wishes_04.mp4',
            'read_more_books': 'Wishes_05.mp4',
        }

    def generate_video_for_many_child(self, base_dir, file_name, chat_id):
        with open(f'{base_dir}/staticfiles/videos/all/files.txt', 'w', encoding='utf-8') as f:
            f.write(
                'file K_01_constant.mp4\n'
                f'file {self.many_child_wishes.get(file_name)}\n'
                'file K_02_constant.mp4'
            )

        os.system(
            f"ffmpeg -y -f concat -safe 0 -i {base_dir}/staticfiles/videos/all/files.txt -c copy {base_dir}/staticfiles/videos/final/{chat_id}.mp4"
        )

        return f"{base_dir}/staticfiles/videos/final/{chat_id}.mp4"

    def generate_video_for_one_child(self, base_dir, chat_id, name, male, age, hobbies, wishes):
        with open(f'{base_dir}/staticfiles/videos/all/files.txt', 'w', encoding='utf-8') as f:
            if male == 'male':
                f.write(
                    'file M_01_constant.mp4\n'
                    f'file {self.name_m.get(name)}\n'
                    'file M_02_constant.mp4\n'
                    f'file {self.ages.get(age)}\n'
                    'file M_03_constant.mp4\n'
                    f'file {self.hobbies.get(hobbies)}\n'
                    'file M_04_constant.mp4\n'
                    f'file {self.wishes.get(wishes)}\n'
                    'file M_05_constant.mp4'
                )

            elif male == 'female':
                f.write(
                    'file W_01_constant.mp4\n'
                    f'file {self.name_w.get(name)}\n'
                    'file W_02_constant.mp4\n'
                    f'file {self.ages.get(age)}\n'
                    'file W_03_constant.mp4\n'
                    f'file {self.hobbies.get(hobbies)}\n'
                    'file W_04_constant.mp4\n'
                    f'file {self.wishes.get(wishes)}\n'
                    'file W_05_constant.mp4'
                )

        os.system(
            f"ffmpeg -y -f concat -safe 0 -i {base_dir}/staticfiles/videos/all/files.txt -c copy staticfiles/videos/final/{chat_id}.mp4"
        )

        return f'{base_dir}/staticfiles/videos/final/{chat_id}.mp4'
